Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetObjectsByFilterName Method
 Returns an enumerator of the model objects in the current model selected by the given selection filter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetObjectsByFilterName(
	string FilterName
)
Public Function GetObjectsByFilterName (
	FilterName As String
) As ModelObjectEnumerator
Parameters
FilterName
Type: System.String
The name of an existing selection filter to apply.
Return Value
Type: ModelObjectEnumerator
A model object enumerator of the objects selected by the filter.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace